fixed report use case diagram issues
